app/views/breweries/_brewery_card.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "brewery_categories" ON "categories"."id" = "brewery_categories"."category_id" WHERE "brewery_categories"."brewery_id" = ?  [["brewery_id", 1]]
---
            <ul class="list-inline">
                <% brewery.categories.each do |category| %>