app/views/breweries/_form.html.erb

SELECT "categories".* FROM "categories"
---
        <div class="col-sm-10">
            <%= f.collection_check_boxes :category_ids, Category.all, :id, :name %>