app/views/breweries/index.html.erb

                    <div class="col-sm-8 py-2">
                      <%= f.collection_select :category, Category.all, :id, :name, include_blank: "Not functional", class: "form-control" %>
---
SELECT "categories".* FROM "categories"