app/views/breweries/show.html.erb

                        <h3>Categories</h3>
                        <% @brewery.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "brewery_categories" ON "categories"."id" = "brewery_categories"."category_id" WHERE "brewery_categories"."brewery_id" = ?  [["brewery_id", 1]]

                    <div class="reviews">
                        <% if @brewery.reviews.blank? %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."brewery_id" = ?  [["brewery_id", 2]]