app/controllers/breweries_controller.rb

SELECT "breweries".* FROM "breweries"
---
    def index
        # visitor_location = request.location.city
        @breweries = Brewery.all

SELECT "categories".* FROM "categories"
---
    def new
        @brewery = Brewery.new
        @categories = 3.times.collect { @brewery.categories.build }

INSERT INTO "breweries" ("name", "address1", "address2", "city", "state", "zipcode", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "submitted_by") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @brewery = Brewery.new(brewery_params)
        @brewery.submitted_by = current_user.id

        if @brewery.save

SELECT  "favorite_breweries".* FROM "favorite_breweries" WHERE "favorite_breweries"."user_id" IS NULL AND "favorite_breweries"."brewery_id" = 2 LIMIT ?  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @favorite = Favoritebrewery.find_by(user: current_user, brewery: @brewery).present?
        @submitted = User.find(@brewery.submitted_by)

SELECT "categories"."id" FROM "categories" INNER JOIN "brewery_categories" ON "categories"."id" = "brewery_categories"."category_id" WHERE "brewery_categories"."brewery_id" = ?  [["brewery_id", 51]]
---
    def edit
        @categories = 3.times.collect { @brewery.categories.build }

UPDATE "breweries" SET "address1" = ?, "address2" = ?, "city" = ?, "state" = ?, "zipcode" = ?, "updated_at" = ? WHERE "breweries"."id" = ?  [["address1", "25 Mountain Ave"], ["address2", ""], ["city", "Mendham"], ["state", "NJ"], ["zipcode", "08945"], ["updated_at", "2018-03-21 21:07:14.973790"], ["id", 51]]
---
    def update
        if @brewery.update(brewery_params)