app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("user_id", "brewery_id", "rating", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["brewery_id", 2], ["rating", 2], ["content", "asfdsf"], ["created_at", "2018-03-21 19:49:11.710310"], ["updated_at", "2018-03-21 19:49:11.710310"]]
---
    def create
        @review = @brewery.reviews.build(review_params)
        @review.user_id = current_user.id

        if @review.save

SELECT  "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_brewery
        @brewery = Brewery.find(params[:brewery_id])